## Mini Project III

In [16]:
import numpy as np
import pandas as pd
import requests as re
import json

In [34]:
twm_accounts = pd.read_csv('data/twm_accounts.csv', sep = ';')
twm_accounts.name = 'accounts' 
twm_checking_acct = pd.read_csv('data/twm_checking_acct.csv', sep = ';')
twm_checking_acct.name = 'checking_acct'
twm_checking_tran = pd.read_csv('data/twm_checking_tran.csv', sep = ';')
twm_checking_tran.name = 'checking_tran'
twm_credit_acct = pd.read_csv('data/twm_credit_acct.csv', sep = ';')
twm_credit_acct.name = 'credit_acct'
twm_credit_tran = pd.read_csv('data/twm_credit_tran.csv', sep = ';')
twm_credit_tran.name = 'credit_tran'
twm_customer = pd.read_csv('data/twm_customer.csv', sep = ';')
twm_customer.name = 'customer'
twm_savings_acct = pd.read_csv('data/twm_savings_acct.csv', sep = ';')
twm_savings_acct.name = 'savings_acct'
twm_savings_tran = pd.read_csv('data/twm_savings_tran.csv', sep = ';')
twm_savings_tran.name = 'savings_tran'
twm_transactions = pd.read_csv('data/twm_transactions.csv', sep = ';')
twm_transactions.name = 'transactions'

In [35]:
CSVs = [twm_accounts,
twm_checking_acct,
twm_checking_tran,
twm_credit_acct,
twm_credit_tran,
twm_customer,
twm_savings_acct,
twm_savings_tran,
twm_transactions]

In [44]:
twm_accounts.head(1)

,acct_nbr,cust_id,acct_type,account_active,acct_start_date,acct_end_date,starting_balance,ending_balance
0,13628063,1362806,SV,Y,10.12.1995,NaN,1430.22,284.58

In [45]:
twm_checking_acct.head(1)

,cust_id,acct_nbr,minimum_balance,per_check_fee,account_active,acct_start_date,acct_end_date,starting_balance,ending_balance
0,1362548,13625482,3000,0.0,Y,11.11.1986,NaN,6004.34,569.65

In [46]:
twm_checking_tran.head(1)

,cust_id,tran_id,tran_amt,principal_amt,interest_amt,new_balance,tran_date,tran_time,channel,tran_code
0,1363481,26,-0.15,-0.15,0.0,58.99,29.1.1995,,,FK

In [47]:
twm_credit_acct.head(1)

,cust_id,acct_nbr,credit_limit,credit_rating,account_active,acct_start_date,acct_end_date,starting_balance,ending_balance
0,1363160,4561143213631600,1000,0,Y,12.10.1988,NaN,657.46,286.69

In [48]:
twm_credit_tran.head(1)

,cust_id,tran_id,tran_amt,principal_amt,interest_amt,new_balance,tran_date,tran_time,channel,tran_code
0,1363088,46,-121.49,-121.49,0.0,-141.0,20.10.1995,101144,E,CG

In [49]:
twm_customer.head(1)

,cust_id,income,age,years_with_bank,nbr_children,gender,marital_status,name_prefix,first_name,last_name,street_nbr,street_name,postal_code,city_name,state_code
0,1362691,26150,46,5,1,M,2,,Donald ...,Marek ...,8298,Second ...,89194,Las Vegas,NV

In [51]:
twm_savings_acct.head(1)

,cust_id,acct_nbr,minimum_balance,acct_type,account_active,acct_start_date,acct_end_date,starting_balance,ending_balance
0,1363160,13631603,100,BS,Y,9.5.1988,NaN,113.04,122.54

In [52]:
twm_savings_tran.head(1)

,cust_id,tran_id,tran_amt,principal_amt,interest_amt,new_balance,tran_date,tran_time,channel,tran_code
0,1363481,26,136.03,136.03,0.0,1521.57,26.10.1995,84111,A,DP

In [53]:
twm_transactions.head(1)

,tran_id,acct_nbr,tran_amt,principal_amt,interest_amt,new_balance,tran_date,tran_time,channel,tran_code
0,27,13625623,0.0,0.0,0.0,3753.34,21.10.1995,121656,A,IQ